Assignment_1/FIO/q1/output_q1.txt
read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
randread: (g=1): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.28
Starting 2 processes
read: Laying out IO file (1 file / 64MiB)

read: (groupid=0, jobs=1): err= 0: pid=302876: Fri Apr 11 16:09:52 2025
  read: IOPS=57.9k, BW=226MiB/s (237MB/s)(64.0MiB/283msec)
    clat (usec): min=12, max=1102, avg=16.94, stdev=17.05
     lat (usec): min=12, max=1102, avg=16.96, stdev=17.06
    clat percentiles (usec):
     |  1.00th=[   14],  5.00th=[   15], 10.00th=[   15], 20.00th=[   15],
     | 30.00th=[   15], 40.00th=[   15], 50.00th=[   16], 60.00th=[   17],
     | 70.00th=[   17], 80.00th=[   18], 90.00th=[   19], 95.00th=[   23],
     | 99.00th=[   37], 99.50th=[   46], 99.90th=[  102], 99.95th=[  115],
     | 99.99th=[ 1074]
  lat (usec)   : 20=92.29%, 50=7.29%, 100=0.30%, 250=0.09%, 500=0.01%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.02%
  cpu          : usr=5.67%, sys=27.30%, ctx=16382, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16384,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
randread: (groupid=1, jobs=1): err= 0: pid=302877: Fri Apr 11 16:09:52 2025
  read: IOPS=18.2k, BW=71.0MiB/s (74.4MB/s)(64.0MiB/902msec)
    clat (usec): min=49, max=164, avg=54.51, stdev= 6.01
     lat (usec): min=49, max=164, avg=54.54, stdev= 6.02
    clat percentiles (usec):
     |  1.00th=[   51],  5.00th=[   51], 10.00th=[   51], 20.00th=[   52],
     | 30.00th=[   52], 40.00th=[   53], 50.00th=[   53], 60.00th=[   54],
     | 70.00th=[   55], 80.00th=[   56], 90.00th=[   60], 95.00th=[   63],
     | 99.00th=[   83], 99.50th=[   96], 99.90th=[  112], 99.95th=[  130],
     | 99.99th=[  153]
   bw (  KiB/s): min=73000, max=73000, per=100.00%, avg=73000.00, stdev= 0.00, samples=1
   iops        : min=18250, max=18250, avg=18250.00, stdev= 0.00, samples=1
  lat (usec)   : 50=0.01%, 100=99.76%, 250=0.23%
  cpu          : usr=2.66%, sys=9.10%, ctx=16384, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16384,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=226MiB/s (237MB/s), 226MiB/s-226MiB/s (237MB/s-237MB/s), io=64.0MiB (67.1MB), run=283-283msec

Run status group 1 (all jobs):
   READ: bw=71.0MiB/s (74.4MB/s), 71.0MiB/s-71.0MiB/s (74.4MB/s-74.4MB/s), io=64.0MiB (67.1MB), run=902-902msec

Disk stats (read/write):
  nvme0n1: ios=30783/60, merge=2/18, ticks=920/22, in_queue=946, util=66.59%